current/app/controllers/trains_controller.rb

SELECT `trains`.* FROM `trains` WHERE (location = '81700')
SELECT `trains`.* FROM `trains`
---
	def rawdata

        @out2 =[]
        @train = Train.where("location = '81700'")
        @out = Train.all